
'''

    Зробити функцію, яка дає можливість користувачу ввести число.

    Програма має перевірити число на коректність використовуючи винятки.

    В разі некоректного введення програма просить користувача ввести число ще
    раз і повторює це до тих пір, доки користувач не введе коректне значення.

    Функція приймає як параметр повідомлення, яке треба виводити перед
    введенням користувача та повертає введене користувачем значення.

    Додатково:
    Додати у функцію параметри min_value та max_value. За замовчанням їх
    значення має бути None. Якщо у ці параметри передані значення, тоді
    вони означають мінімальне та максимальне обмеження значення числа.
    Якщо число, яке ввів користувач, виходить за ці обмеження — треба
    повідомити про це користувача і попросити ввести значення ще раз.

'''
'''
    Є список фруктів. Програма має вивести пронумерований список на екран та
    дати можливість користувачу обрати один з його елементів (введенням індексу
    елементу).
    
    При введенні даних користувачем перевіряти чи є такий індекс в списку та
    чи коректне значення ввів користувач. Перевірки реалізувати блоком
    try .. except. 

'''
